package com.heeexy.example.util.constants;

/**
 * @author: hxy
 * @date: 2017/10/24 10:16
 */
public enum ErrorEnum {
    /*
     * 错误信息
     * */
    E_400("400", "请求处理异常，请稍后再试"),
    E_500("500", "请求方式有误,请检查 GET/POST"),
    E_501("501", "请求路径不存在"),
    E_502("502", "权限不足"),
    E_10008("10008", "角色删除失败,尚有用户属于此角色"),
    E_10009("10009", "账户已存在"),
    E_10010("10010", "库存异常，审核失败"),
    E_20011("20011", "登陆已过期,请重新登陆"),
    E_100001("100001", "无法找到采购单"),
    E_100002("100002", "该入库单已审核通过，无法删除"),
    E_100003("100003", "该采购单财务尚未通过，无法入库"),
    E_100004("100004", "该采购单入库已完成"),
    E_100005("100005", "出库数量超过库存数目"),
    E_100006("100006", "该供应商已存在"),
    E_100007("100007", "产品删除失败，该产品尚有采购记录"),
    E_100008("100008", "产品删除失败，该产品尚有入库记录"),
    E_100009("100008", "存在不是待提交状态的采购单"),
    E_100010("100010", "供应商删除失败，该供应商尚有对应采购单"),
    E_100011("100011", "供应商删除失败，该供应商尚有对应产品"),
    E_100012("100012", "该sku已存在"),
    E_100013("100013", "查无此货运单号"),
    E_100014("100014", "母代码删除失败，该产品尚有下属sku"),
    E_100015("100015", "导入文件为空"),
    E_100016("100016", "请选择仓库"),
    E_100017("100017", "缺少价格"),
    E_90003("90003", "缺少必填参数");;

    private String errorCode;

    private String errorMsg;

    ErrorEnum(String errorCode, String errorMsg) {
        this.errorCode = errorCode;
        this.errorMsg = errorMsg;
    }

    public String getErrorCode() {
        return errorCode;
    }

    public String getErrorMsg() {
        return errorMsg;
    }

}